# LinkIndex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData..::..LinkIndex Property
DuctFittingAndAccessoryConnectorData Class See Also
---
the index of the connector which is linked with this connector
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int LinkIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LinkIndex As Integer
	Get
```

Visual C++
---
```text
public:
property int LinkIndex {
	int get ();
}
```

# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace